In [55]:
import pandas
import json
import csv

# Extracting CSV

Using pandas to extract csv data.

In [59]:
csv_filepath = "dataset/supermarket-sales.csv"
csv_dataframe = pandas.read_csv(csv_filepath, sep=",")
csv_records = csv_dataframe.to_dict(orient="records")

Using standard library by iterating one by one.

In [78]:
csv_filepath = "dataset/supermarket-sales.csv"
csv_dataset = []

with open(csv_filepath) as csv_file:
    csv_reader = csv.DictReader(csv_file, delimiter=',')
    line_count = 0
    for row in csv_reader:
        if line_count == 0:
            line_count += 1
            continue

        csv_dataset.append(row)
        line_count += 1

print("Data:")
print("Invoice ID: {}".format(csv_dataset[0]['Invoice ID']))
print("Branch: {}".format(csv_dataset[0]['Branch']))
print("City: {}".format(csv_dataset[0]['City']))

Data:
Invoice ID: 226-31-3081
Branch: C
City: Naypyitaw

# Extracting JSON

Nested data with JSON

In [73]:
json_filepath = "dataset/dataset-question-1.json"

with open(json_filepath) as file:
    json_data = json.load(file)

data_1 = json_data["data"][0]
data_1_title = data_1["title"]
data_1_paragraphs = data_1["paragraphs"]
data_1_text = [p["context"] for p in data_1_paragraphs]
data_1_question = [
    qas["question"] 
    for p in data_1_paragraphs 
    for qas in p["qas"]]

New line delimited JSON

In [90]:
json_filepath = "dataset/supermarket-sales.json"
json_collection = []

with open(json_filepath) as file:
    for line in file:
        json_data = json.loads(line)
        json_collection.append(json_data)

# Extracting PostgreSQL

In [2]:
from sqlalchemy import create_engine

In [5]:
engine = create_engine('postgresql://postgres:mysecret@localhost:5432/dataset_restapi')

In [49]:
pandas.read_sql("SELECT * FROM marketing_user", engine)

         id  year_birth   education marital_status   income
0      5524        1957  Graduation         Single  58138.0
1      2174        1954  Graduation         Single  46344.0
2      4141        1965  Graduation       Together  71613.0
3      6182        1984  Graduation       Together  26646.0
4      5324        1981         PhD        Married  58293.0
...     ...         ...         ...            ...      ...
2235  10870        1967  Graduation        Married  61223.0
2236   4001        1946         PhD       Together  64014.0
2237   7270        1981  Graduation       Divorced  56981.0
2238   8235        1956      Master       Together  69245.0
2239   9405        1954         PhD        Married  52869.0

[2240 rows x 5 columns]

Query data with filter parameter

In [91]:
query = """
SELECT * FROM marketing_user
WHERE education = %(education)s 
AND marital_status = %(marital_status)s
"""
params = {
    'education': 'Graduation',
    'marital_status': 'Single'
}

pandas.read_sql(query, engine, params=params)

        id  year_birth   education marital_status   income
0     5524        1957  Graduation         Single  58138.0
1     2174        1954  Graduation         Single  46344.0
2     7892        1969  Graduation         Single  18589.0
3     5255        1986  Graduation         Single      NaN
4     1371        1976  Graduation         Single  79941.0
..     ...         ...         ...            ...      ...
247  10968        1969  Graduation         Single  57731.0
248   5959        1968  Graduation         Single  35893.0
249   4201        1962  Graduation         Single  57967.0
250   7004        1984  Graduation         Single  11012.0
251   8080        1986  Graduation         Single  26816.0

[252 rows x 5 columns]

Query distinct data on specific column

In [93]:
query = """
SELECT DISTINCT education FROM marketing_user
"""
pandas.read_sql(query, engine)

    education
0       Basic
1    2n Cycle
2      Master
3         PhD
4  Graduation

In [94]:
query = """
SELECT DISTINCT marital_status FROM marketing_user
"""
pandas.read_sql(query, engine)

  marital_status
0          Widow
1           YOLO
2       Together
3          Alone
4         Absurd
5        Married
6       Divorced
7         Single